[{"status":"Advance to Further Review","review1":18,"review2":16.0,"avg":17.0,"initial":null,"no":"17-006","combined":null,"title":"Trail improvements @ Roxhill Park","need":"Trail improvements at Roxhill Park - violence and danger in park, drug use, public intoxication ","idea":"Improve lighting and trim trees around trails .. Interpretive trail improvements ","latitude":47.51775,"longitude":-122.36925,"location":"Roxhill Park","type":"Walkways","dept":"Parks","benefits":"neighbors, Westwood Village, and city of Seattle ","dist":1,"neigh":"South Delridge"},{"status":"Advance to Further Review","review1":20,"review2":20.0,"avg":20.0,"initial":null,"no":"17-014","combined":null,"title":"Improve 5-way intersection @ Dallas Ave S, 12th Ave S, and Thistle St","need":"A traffic calming mechanism is much needed at a FIVE WAY intersection with no lights or stop signs at Dallas Ave S, 12th Ave S, and S Thistle St. There is a large business with over 100 employees & cars at this corner and it is a pedestrian pathway from the bus on 14th. There have been several near-miss incidents on this corner. ","idea":"Simple all-way stop signs; adding stop signs or yield signs. Perhaps even a roundabout. Adding crosswalks (with flashing lights) to multiple corners since it's an odd intersection. Adding a dedicated bike lane as well because a lot of cyclists go through here daily.","latitude":47.51939,"longitude":-122.31501,"location":"Dallas Ave S, 12th Ave S, S Thistle St","type":"Crossing Improvements","dept":"SDOT","benefits":"The neighbors who live at this intersection (some feel they are in danger of having a car come through their window), the neighbors who use Dallas Ave as a thoroughfare to enter and exit South Park's waterfront, the business owner and employees of the company that is currently expanding at this intersection. Many of us have witnessed accidents and confusion here. ","dist":1,"neigh":"South Park"},{"status":"Advance to Further Review","review1":16,"review2":16.0,"avg":16.0,"initial":null,"no":"17-019","combined":null,"title":"Busstop improvements on Barton St","need":"The \"Delridge Bus Triangle\" located at 9200 Delridge Way, is an SDOT managed property in the heart of the Westwood Highland Park Residential Urban Village. This public right of way is fraught with hiding places for intravenous drug use, drug dealing, prostitution and illegal dumping right along the heavy commuter driven Delridge Way corridor.  Delridge is unsafe to cross at this natural central location. This area has a high pedestrian inter-connectivity between pending Delridge H Rapid Ride line to the east, and the Westwood Village Transit mall at Roxbury Park to the west along Barton Street SW.","idea":"We have already created a \"Friends of the Delridge Bus Triangle\" committee, in partnership with SDOT. We held our first meeting on Jan 28th, 2017 to document the history, needs and collective vision of the space. That document can be found here: https:\/\/docs.google.com\/document\/d\/1WbNyNKrp7B3TAM4S_uBV6g2NK3bN-wELv97QLfSB4ak\/edit","latitude":47.520934,"longitude":-122.35829,"location":"9200 Delridge Way SW, cross streets are Barton STREET SW to the north, and 18th Ave SW to the east. ","type":"Other","dept":"SDOT","benefits":"Everyone living in along the South Delridge Corridor, with particular benefit to the marginalized, at-risk children that live in the densely populated area immediately east of this space. ","dist":1,"neigh":"South Delridge"},{"status":"Advance to Further Review","review1":15,"review2":18.0,"avg":16.5,"initial":null,"no":"17-031","combined":null,"title":"Crossing Improvement along SW Henderson St","need":"Improve crossings along SW Henderson St at 12th, 13th, or 17th Ave SW","idea":"A clearly marked cross walk and parking restrictions near the curb would be a start to helping to increase visibility for cars as well as pedestrians.   Extending the curbs, however, would make a huge difference.   This would allow cars on Henderson to far more easily see pedestrians who are trying to cross on their way to and from school. ","latitude":47.52284,"longitude":-122.35164,"location":"Henderson & 13th Ave SW 98106","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians and drivers alike.  The neighborhood benefits by an increase in safety and walkability.","dist":1,"neigh":"Highland Park"},{"status":"Advance to Further Review","review1":20,"review2":17.0,"avg":18.5,"initial":null,"no":"17-044","combined":null,"title":"Improved crossings on S. Cloverdale ","need":"S Cloverdale St is a busy road and 12th Ave S was identified in South Park's Open Space plan as a secondary improved walking\/bike route. We would like to increase the safety for pedestrians to cross Cloverdale at 8th, 10th, or 12th Ave S; Cars speed through a vital intersection in neighborhood. It's near a freeway entrance and it's an arterial but pedestrians must cross this particular street to access neighborhood offerings; Safer crossing on cloverdale in South park to the elementary school.","idea":"Crosswalks on S. Cloverdale at 8th Ave S, 10th Ave S. and\/or 12th Ave S. for pedestrians to cross safely with a high vis sign alerting drivers to the possibility of pedestrians; Speed bumps, crosswalks, and wheelchair accessibility.  Sidewalks and planter strips ;Light up crosswalks. ","latitude":47.52645,"longitude":-122.32023,"location":"S. Cloverdale at 10th Ave S and 12th Ave S. Skate Park, South Park Meadow Dallas and 12th Ave S, Cloverdale and 5th Ave s.","type":"Crossing Improvements","dept":"SDOT","benefits":"The entire neighborhood ","dist":1,"neigh":"South Park"},{"status":"Advance to Further Review","review1":14,"review2":18.0,"avg":16.0,"initial":null,"no":"17-068","combined":null,"title":"Crossing improvements at 35th Ave & SW Dawson St","need":"Safer ped crossing @ 35th Ave SW to Camp Long, near SW Dawson St ","idea":"A crosswalk at the intersection of 35th Ave SW and SW Dawson Street (the entrance to Camp Long), including an island in the median.","latitude":47.555598,"longitude":-122.376317,"location":"The intersection between 35th Ave SW and SW Dawson Street in West Seattle","type":"Crossing Improvements","dept":"SDOT","benefits":"Children, community members and nature-lovers who use Camp Long and live in the surrounding area.","dist":1,"neigh":"West Seattle"},{"status":"Advance to Further Review","review1":17,"review2":17.0,"avg":17.0,"initial":null,"no":"17-085","combined":null,"title":"Add sidewalks to S. Sylvan Way","need":"To make the community safer.  It's a residential area and kids take the bus and some walk to school.  There is also a sharp curve and cars drive fast.  Its really unsafe.","idea":"Add sidewalks to S. Sylvan Way","latitude":47.540606,"longitude":-122.369774,"location":"S. Sylvan Way","type":null,"dept":"SDOT","benefits":"People walking","dist":1,"neigh":"High Point"},{"status":"Advance to Further Review","review1":16,"review2":19.0,"avg":17.5,"initial":null,"no":"17-145","combined":null,"title":"Install painted crosswalk at SW Alaska St. and 38th Ave SW","need":"The intersection of SW Alaska and 38th Ave SW is a very congested intersection for both vehicles and pedestrians that would benefit both by having a marked North-South crosswalk.    Transit  On the northwest corner of the intersection there is the C Line Rapid Ride stop. With the fairly recent addition of new apartments (Link, Spruce) and the current addition of more (Whittaker) as well as the proposed upzoning of the single family housing near this intersection the amount of commuter traffic that exits at this stop is heavy today and will continue to grow over time.      Safety  During peak travel times westbound vehicle traffic on SW Alaska backs up from the SW Alaska and Fauntleroy Way SW intersection back through the SW Alaska and 38th Ave SW intersection.  Vehicles often block the intersection which creates a safety issue for pedestrians trying to cross to the south side of the street.  Vehicles trying to pass through the intersection north-south on 38th Ave SW are also blocked and cause those sides of the intersection to back up as well.  It also creates a safety issue as there is a fire station on the southeast corner of the intersection.  Additionally, students that are in the walk zone to Fairmount Park Elementary also need to cross this intersection to get to school.","idea":"Create a market north-south crosswalk on the west side of the street.  SDOT should determine whether additional measures such as overhead signs or flashing beacons are also necessary","latitude":47.56105,"longitude":-122.3801,"location":"The intersection of SW Alaska and 38th Ave SW","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians, Elementary school students, motoristsFire station","dist":1,"neigh":"West Seattle"},{"status":"Advance to Further Review","review1":0,"review2":19.0,"avg":9.5,"initial":null,"no":"17-146 ","combined":"With 17-145","title":"Improve crossing at Alaska Ave & 37th St","need":"It is dangerous to cross Alaska Ave at 37th.  Cars do not always see pedestrians.  Due to the proximity to the Y and other businesses in the Triangle, crossing at Fauntleroy or 35th is not as common as people crossing at 37th, and it can be risky.  ","idea":"A cross-walk with signage.  No light, just a crosswalk light up sign at most.  ","latitude":47.56106,"longitude":-122.37879,"location":"37th Ave SW and Alaska","type":"Crossing Improvements","dept":"SDOT","benefits":"The community in the Fairmount Park area along with all the apartment dwellers that park in our neighborhood due to poor planning for parking at the aparments.  ","dist":1,"neigh":"Fairmount Park"},{"status":"Advance to Further Review","review1":0,"review2":15.0,"avg":7.5,"initial":null,"no":"17-147","combined":"With 17-145","title":"Improve crossing at Alaska Ave & 37th St","need":"Pedestrian safety at intersection of SW Alaska and 37th AVE SW.  With the new Rapid Ride bus lanes on Alaska and general increase in traffic due to all of the new housing (and yet to come housing) in the Alaska Junction, crossing Alaska is very difficult.  Now that the YMCA has been remodeled, there is an increasing number of pedestrians trying to cross SW Alaska.  Already there have been multiple vehicle accidents at this intersection and we should take action before a serious accident occurs.","idea":"Cross walk with flashing lights","latitude":47.56106,"longitude":-122.37879,"location":"intersection of 37th AVE SW and SW Alaska","type":"Crossing Improvements","dept":"SDOT","benefits":"Alaska Junction and nearby neighborhood residents will be able to safely cross SW Alaska St.","dist":1,"neigh":"West Seattle"},{"status":"Advance to Further Review","review1":18,"review2":16.0,"avg":17.0,"initial":null,"no":"17-153","combined":null,"title":"Install crosswalk near Youngstown","need":"Pedestrian overpass improvement \/ crosswalk installation","idea":"improve safety by slowing of traffic along residential road and providing better pedestrian access","latitude":47.563916,"longitude":-122.362869,"location":"Delridge Way SW - between Youngstown Cultural arts center and Delridge Playfield","type":"Crossing Improvements","dept":"SDOT","benefits":"park users, pedestrians, residents","dist":1,"neigh":"Delridge"},{"status":"Advance to Further Review","review1":8,"review2":20.0,"avg":14.0,"initial":null,"no":"17-163","combined":null,"title":"Traffic-calming on Avalon Way ","need":"Avalon is not a Truck route, yet trucks are the major traffic issue. There is only one light (at Genesee) and speeding is an issue with very few locations to cross the street in a residential zone. City has ignored request for speed study, blown off inquiries and replied 'there is nothing that can be done on that road'. Construction traffic at ALL hours through a residential neighborhood is disruptive. Bike lane is scary due to multiplex parking garage entrances. Street parking is at maximum capacity. Constant roar of traffic makes it undesirable to use Avalon as a pedestrian.","idea":"Traffic Calming plan would be a great start. Signs that say no Trucks and re-route to Fauntleroy (that is the primary Truck route) would be a start. Tree Planting for noise abatement and Parking plan, less micro and no parking property development, additional crossing and\/or stop lights.","latitude":47.57142,"longitude":-122.37071,"location":"Avalon Way - between Spokane and 35th","type":"Traffic-Calming","dept":"SDOT","benefits":"Neighborhood Residents","dist":1,"neigh":"West Seattle - Fairmount"},{"status":"Advance to Further Review","review1":14,"review2":19.0,"avg":16.5,"initial":null,"no":"17-181","combined":null,"title":"Traffic-calming along Beacon Ave S, north and south of Bond St","need":"Since the 1970s thrill seekers have sought out our segment of Beacon Ave S to \"jump the hump,\" a dangerous stunt where drivers speed down a 13% grade and launch into the air off a small dip in the road. Last February a teenaged driver doing this lost control of his vehicle, which careened, flipped and rolled twice before coming to rest upside down on the roadway trapping him and his 4 juvenile passengers inside.    There are no sidewalks on our segment of Beacon Ave S, which children walk along daily to catch the school bus. Aside from the elicit reckless driving, there is a general speeding problem from drivers bypassing 51st Ave S by using our neighborhood street as an arterial. The steep grades on either side of S Bond Street aggravate poor speed regulation even by local access drivers, and traffic calming measures are sorely needed.    Doppler radar data collected over an eight day period on Beacon Ave S 100 feet north of S Bond Street showed an 85th percentile of 34MPH and a 99th percentile of 43MPH. This means that fully 15% of the drivers on our road during this period broke the speed limit by at least 9MPH and 1% by at least 18MPH. The maximum speed recorded was 47MPH!    We are united as a neighborhood in a legitimate fear of being struck by speeding drivers on Beacon Ave S. Our pets have been their victims, they have been their own victims and it's only a matter of time until a bystander is injured or killed.","idea":"We believe speed humps on Beacon Ave S on either side of S Bond Street will effectively discourage speeding. Thrill seekers could then no longer \"jump the hump\" without serious damage to their vehicles, using our street as a bypass for 51st Ave S will no longer save time and local access drivers will develop better habits with the humps as a gentle reminder.","latitude":47.51429,"longitude":-122.27377,"location":"The flat segments of Beacon Ave S north and south of S Bond Street","type":"Traffic-Calming","dept":"SDOT","benefits":"Our segment of Beacon Ave S is a popular walking and jogging destination due to the picturesque 18 acre horse farm along the east side of the road. Both immediate residents and those of the area at large will benefit from this traffic calming project due to increase in public safety.","dist":2,"neigh":"Rainier Beach"},{"status":"Advance to Further Review","review1":13,"review2":19.0,"avg":16.0,"initial":null,"no":"17-190","combined":null,"title":"Install lighting along Henderson St","need":"improve visibility at night along the sidewalks between the Link light rail station and nearby homes \/ businesses","idea":"augmenting lighting infrastructure","latitude":47.52328,"longitude":-122.279,"location":"area along S Henderson St between MLK Way S and Renton Ave S","type":"Lighting","dept":"SDOT","benefits":"pedestrians, residents, commuters","dist":2,"neigh":"Rainier Beach"},{"status":"Advance to Further Review","review1":16,"review2":14.0,"avg":15.0,"initial":null,"no":"17-203","combined":null,"title":"Beautify Rose St. Triangle","need":"public beautification, possible CPTED to deter \"chronic dumping problem\" in the Rose ST triangle park","idea":"\"Public art rehabilitiation\"","latitude":47.52913,"longitude":-122.26999,"location":"S Rose St \"Triangle Park\"","type":"Place-making\/Beautification","dept":"SDOT","benefits":"park users, pedestrians, residents","dist":2,"neigh":"Rainier Beach"},{"status":"Advance to Further Review","review1":18,"review2":20.0,"avg":19.0,"initial":null,"no":"17-235","combined":null,"title":"Walkway improvements on 4th Ave S, between E. Marginal Way & Michigan","need":"The sidewalk is missing on the part of 4th Ave S between East Marginal to 4th Ave S between Michigan. This area is where residents walk to access the food bank at St. Vicent de Paul on 4th Ave S. It is where students from SSCC walk to get lunch at a variety of restaurants. Employees from our local industrial community have also complained that accessing food in this area is dangerous. There are many cars that have been run off the road purely because you can't tell where the street or parking lot begins or ends. Street trees would also be needed to reduce noise and air pollution. When a sidewalk with street trees are in place, the walk for residents and employees to access food would become safe and beautiful.","idea":"We need drainage, sidewalks, curbs and street trees.This has been supported in the past by a grant that was given to the Georgetown community then taken away. I was told we needed drainage, so we got nothing instead.","latitude":47.54536,"longitude":-122.32963,"location":"4th Ave S between East Marginal way and Michigan.","type":"Walkways","dept":"SDOT","benefits":"Residents accessing the local food bank, employees accessing lunch and students accessing lunch would benefit from safe sidewalks and street trees. Drivers would benefit by having safe roads and businesses could actually provide safe parking.","dist":2,"neigh":"Georgetown"},{"status":"Advance to Further Review","review1":12,"review2":19.0,"avg":15.5,"initial":null,"no":"17-239","combined":null,"title":"Traffic-calming along Flora Ave S","need":"Georgetown has two small residential areas that are located between highways and arterial streets. In an effort to get around the traffic, many cars cut through the residential streets - at high speeds - careening around traffic circles and driving in very unsafe ways. Our residential, non-arterial streets have many people traveling on foot and bicycle and these cut-through drivers are a danger to us and themselves.","idea":"There are a total of 14 blocks of non-arterial residential streets in Georgetown. I am suggesting we add one speed bump to each of those blocks to slow traffic.","latitude":47.546041,"longitude":-122.319499,"location":"Flora Ave S, between E Marginal Way S and S Bailey St; Carleton Ave S, between E Marginal Way and S Bailey St; S Orcas street between Corson Ave S and 7th Ave S; S Homer St, between Corson Ave S and 7th Ave S","type":"Traffic-Calming","dept":"SDOT","benefits":"residents and visitors to Georgetown's residential areas; children who live in the neighborhood; drivers who should be driving more safely","dist":2,"neigh":"Georgetown"},{"status":"Advance to Further Review","review1":16,"review2":13.0,"avg":14.5,"initial":null,"no":"17-262","combined":null,"title":"ADA ramps along 39th Ave S","need":"While there are generally sidewalks on 39th Ave S north of Aki Kurose Middle School between Orcas and Brandon for some reason the sidewalks are missing at most corners.  There is mud, grass, gravel and other surfaces that allow vehicles to take corners faster while making walking, stroller use and wheelchair use more challenging.  The intersections of 39th Ave S and Findlay, Lucile and Brandon need sidewalk corners paved including curb ramps.","idea":"The intersections of 39th Ave S and Findlay, Lucile and Brandon need sidewalk corners paved including curb ramps.","latitude":47.55196,"longitude":-122.28345,"location":"The intersections of 39th Ave S and Findlay, Lucile and Brandon","type":"Accessibility Improvements","dept":"SDOT","benefits":"Students of nearby schools (Aki Kurose, St. Edward's and others), elderly and wheelchair user neighbors, visitors and neighbors.","dist":2,"neigh":"Hillman City "},{"status":"Advance to Further Review","review1":14,"review2":16.0,"avg":15.0,"initial":null,"no":"17-263","combined":null,"title":"Improve 15th Ave S and Angeline Crossing","need":"Four amazing Mid-Beacon schools are along a mile stretch on 15th Ave SW. They are Asa Mercer, Maple Elementary, St. George Parish School, and Cleveland High School. Unfortunately, the traffic has gotten so terrible that our children, bicyclists, teachers, parents, and neighbors are forced to risk life and limb daily trying to get from the East side of the street to the West, where three of the four school are located. There are only 2 legitimate crossing locations in that mile stretch, otherwise it's Frogger for All! Coupled with the traffic trying to get on the quick I5 exits, this is a recipe for disaster! We need help! ","idea":"School colors painted on each street crossing that leads to the school, as well as way-making signs with each school name and cross walk lights. (Dream big!) This shows both school and neighborhood pride for an entire community!","latitude":47.552299,"longitude":-122.313904,"location":"From Asa Mercer Middle School to Cleveland High School, a .9 mile route along 15th Ave S","type":"Place-making\/Beautification","dept":"SDOT","benefits":"All of Beacon Hill, and all of those traveling through it to pick up kids, drop off kids, and traveling in our beautiful neighborhood. ","dist":2,"neigh":"Beacon Hill"},{"status":"Advance to Further Review","review1":16,"review2":null,"avg":16.0,"initial":null,"no":"17-266","combined":"With 17-263","title":"Traffic-calming and safe crossings along 15th Ave S","need":"We have 4 schools within less than a mile of one another, all connected by 15th Ave S. There is Asa Mercer Middle School, Maple Elementary School, St. George Parish School, and Cleveland High School. Due to the proximity to an I5 exit and entrance, and the lack of stop lights and signs, this has been an enormous safety issue for the children walking to school, as well as the traffic driving children to and from their respective schools. The crosswalks are not lit, and in fact, are not available. ","idea":"There are three major problems.   1) Make crosswalks that people can use to safely go from the East side of 15th to the West.  2) Slow the traffic coming through, and alleviate the back-up of school pick-ups and drop-offs.  3) Bring together each of these communities to share in the protection of all that walk, ride, or drive in this neighborhood. ","latitude":47.55343,"longitude":-122.31347,"location":"From Asa Mercer Middle School to Cleveland High School, a .9 mile route along 15th Ave S","type":"School Safety","dept":"SDOT","benefits":"All 4 schools and all of the surrounding community.","dist":2,"neigh":"Beacon Hill"},{"status":"Advance to Further Review","review1":17,"review2":10.0,"avg":13.5,"initial":null,"no":"17-300","combined":null,"title":"Traffic Calming along Dakota St","need":"The intersection at 38th Ave S and Dakota is very dangerous.  38th ave s. is an arterial from Spokane to Genesee with no traffic calming along the .5 mile route.  This corner is a very popular crossing for students walking to Hawthorne Elementary (2 blocks east of 38th ave s.).   I watch everyday as cars blast through the intersection without stopping for students waiting patiently for kids to cross the street.  It is an accident waiting to happen! ","idea":"Flashing beacon for the crosswalk at 38th ave s. and Dakota. Or a traffic circle.  But the flashing beacon is probably most realistic as the street is an arterial. ","latitude":47.566235,"longitude":-122.285,"location":"38th ave s. and dakota.","type":"Crossing Improvements","dept":"SDOT","benefits":"Students walking to Hawthorne Elementary, and the greater community. ","dist":2,"neigh":"Mt. Baker"},{"status":"Advance to Further Review","review1":15,"review2":15.0,"avg":15.0,"initial":null,"no":"17-319","combined":null,"title":"Add a verbal crossing notification to S. Beacon Ave & 15th Ave S","need":"Visually impaired persons cannot cross Beacon & 15th Ave intersection safely","idea":"Add a verbal crossing notification to S. Beacon Ave & 15th Ave S","latitude":47.580942,"longitude":-122.313604,"location":"15th Ave S & Beacon Ave","type":"Accessibility Improvements","dept":"SDOT","benefits":null,"dist":2,"neigh":"Beacon Hill"},{"status":"Advance to Further Review","review1":17,"review2":20.0,"avg":18.5,"initial":null,"no":"17-334","combined":null,"title":"Install streetlights and stop signs @ Jackson & 10th Ave S.","need":"street lights\/stop signs - traffic is getting busiers and it's already a busy intersection.   Don't wait until somebody is hurt until it happens.  ","idea":"Purchasing lights, shutting down traffic for a night -  install street lights and stop signs. ","latitude":47.59921,"longitude":-122.31964,"location":"10th & Jackson in the ID ","type":"Crossing Improvements","dept":"SDOT","benefits":"Everyone -- pedestrians and drivers. ","dist":2,"neigh":"Chinatown\/ID"},{"status":"Advance to Further Review","review1":20,"review2":20.0,"avg":20.0,"initial":null,"no":"17-338","combined":null,"title":"ADA improvements to 2nd Ave Ext S and S Jackson intersection","need":"The crossing for 2nd Ave Ext S at S Jackson St is inaccessible and confusing, especially if you have a visual impairment. Many visually impaired travelers commute through this area to get to Bus Stop 1778. The intersection is particularly challenging due the angle of the streets and the heavy volume of left turners on SB 2nd Ave Ext S. If one cannot see the pedestrian crossing lights, the audible cues of the traffic are difficult to decipher and one can often hear the audible signal from the 4th and Jackson intersection. If a person is not familiar with the intersection, they may confuse the audible signal from 4th and Jackson for this intersection and step into traffic.  ","idea":"Add an APS with a different audible tone than the APS at the 4th and Jackson intersection. ","latitude":47.59921,"longitude":-122.3297,"location":"Intersection of 2nd Ave Ext S and S Jackson St. ","type":"Accessibility Improvements","dept":"SDOT","benefits":"All commuters, especially those with visual impairments","dist":7,"neigh":"Chinatown\/ID"},{"status":"Advance to Further Review","review1":18,"review2":17.0,"avg":17.5,"initial":null,"no":"17-347","combined":null,"title":"Restructure corner & add ADA improvements to 25th Ave S & Plum St","need":"The intersection of S Plum Street and 25th Ave South has been the site of a variety of accidents, including residential drivers, Metro drivers, and school buses - and many undocumented near misses, some including pedestrians. Due to the elevation gain on the approach to the intersection from the west and property height at the NW and SW corners a driver’s view of other approaching vehicles is impaired at this Two-Way Stop intersection. The NE corner is taken up  by diagonal parking, which at times includes large vans or trucks that completely block the visual access of drivers traveling south on 25th of vehicles approaching from the east. This street is commonly used by drivers seeking a “short cut” between Rainier or 23rd and MLK Way - often these drivers are in a hurry and speeding. This intersection is directly adjacent to the Lighthouse for the Blind, Inc. and the American red Cross. Both business have many employees and visitors that are traveling through this intersection, both on foot and by vehicle.      ","idea":"By creating a formal corner with ADA approved accessible ramps at the NE corner where one currently does not exist, it will eliminate several parking spaces that obscure the visual angle of drivers watching for cross traffic opening up the intersection for greater pedestrian and vehicular safety.  It would move the intersection forward in improving the overall design of the intersection for pedestrians and drivers while sacrificing only a few parking spaces that should not be there. There is ample parking at the nearby organizations and many free street parking spaces.   Another step towards making the intersection as safe as possible would be to make it a Four-way stop intersection instead of a Two-way stop. This would prevent short-cutting drivers from speeding through the intersection and potentially causing accidents.   ","latitude":47.58547,"longitude":-122.30032,"location":"The NE corner of the intersection of 25th Ave South and South Plum Street.","type":"Accessibility Improvements","dept":"SDOT","benefits":"Employees commuting to the Lighthouse for the Blind, Inc. located on the SE corner of the intersection, employees and visitors to the Red Cross on the NE corner of the intersection, residents and visitors to the neighborhood, including those who may be traveling to the nearby section of the Mountains-to-Sound Greenway, and the employees and many visitors to the 2100 Building (1 block away). The 2100 building is home to 12 non-profits that focus on working with children in the community - children and teens are often traveling through the neighborhood to attend programming.","dist":3,"neigh":"North Rainier"},{"status":"Advance to Further Review","review1":15,"review2":18.0,"avg":16.5,"initial":null,"no":"17-348","combined":null,"title":"Traffic-calming on 24th Ave, near Massachusetts","need":"We are at 24th Ave S between Massachusetts and Grand. There are many open areas  (Colman Park, Childrens Play Garden, Jimi Hendrix Park, plus Bike Trails and Dog Park) for people to feel a false sense of tranquil. Being between 23rd\/MLK, near Rainier and i-90 we get vehicles (motorcycles, cars, big trucks) who cut through on our street looking for a speedy short cut.","idea":"Placing speed bumps on short stretch of street AND a traffic median\/circle in the intersection of 24th Ave S and Grand (VERY dangerous!)- a very bizarre intersection which will increase in traffic when the 3 corners of new residential constriction brings in another 100 people to navigate that, along with the newly routed Bike Route!!! (eeks).","latitude":47.58835,"longitude":-122.30129,"location":"24th Ave S between Grand and Massachusetts ","type":"Traffic-Calming","dept":"SDOT","benefits":"The Preschool, the sports games\/practice for youth with adults, siblings & pets, the elderly who walk the area, families on bicycle outings, dog walkers... etc!","dist":3,"neigh":"Judkins Park"},{"status":"Advance to Further Review","review1":16,"review2":19.0,"avg":17.5,"initial":null,"no":"17-350","combined":null,"title":"Improved connections to Judkins Park","need":"Memorialize the Women's March and connect Judkins Park better to the community.     Judkin's Park is poorly connected on the eastern side to the community. S Dearborn St has a pedestrian activated light to cross 23rd Ave S, but the entrance to the park is not enticing during the day. At night many people loiter around the entrance and there is no pedestrian lighting to get you from the street to the pedestrian lighting further inside the park. Furthermore, there are two paths leading down into the park. One is extremely steep and not accessible and the other is entirely overgrown and uprooted. This means people with wheelchairs, kids of bike going to school, walkers, strollers, or just folks who are less able bodied can't use this access point. ","idea":"Focus on the S Dearborn St entrance to Judkins Park.   1) Add pedestrian lighting from 23rd to the pedestrian lighting inside the park.   2) Fix the overgrown and uprooted path so that it is accessible to people of all ages and abilities.   3) Add a sign or something other than the \"dead end\" sign to welcome people. Perhaps art. Or perhaps a plaque or interpretive sign telling people that this was the starting place of the biggest march in Seattle's history (the 2017 Women's March).   ","latitude":47.595589,"longitude":-122.302666,"location":"Where Dearborn St dead ends in Judkins Park next to 23rd. 2201 S Dearborn St ","type":"Lighting","dept":"Parks","benefits":"People accessing the park or the school, people walking or biking, people walking dogs, people with disabilities, etc. ","dist":3,"neigh":"Judkins Park"},{"status":"Advance to Further Review","review1":17,"review2":13.0,"avg":15.0,"initial":null,"no":"17-354","combined":null,"title":"Traffic-calming on 17th & Yesler","need":"17th Ave S between E Yesler Way and S Jackson St is a residential street which sees high car traffic. This are also has a great deal of pedestrian traffic with it's near by retirement communities, elementary school and street car stop. This area would benefit from improvements pedestrian safety.","idea":"-Traffic circle 17th Ave S and S Washington St.  -Marked crosswalk at 17th Ave S and E Yesler Way. There are already ramps installed.  -Speed Humps installed on 16th Ave S between S Washington St and S Main St. ","latitude":47.60169,"longitude":-122.31027,"location":"17th Ave S between E Yesler Way and S Jackson St","type":"Traffic-Calming","dept":"SDOT","benefits":"Langston Hughes Performing Arts Institute, Kawabe Memorial House, Bailey Gatzert Elementary school children, Casa Latina Seattle, Street Car travelers, Seattle pedestrians","dist":3,"neigh":"Central District"},{"status":"Advance to Further Review","review1":16,"review2":14.0,"avg":15.0,"initial":null,"no":"17-358","combined":null,"title":"Install high - visibility lighting infrastructure at crosswalk spanning 19th Ave E and Cherry St","need":"Unsafe to cross arterial that runs through squire park\/cherry hill neighborhood in CD.  19th Ave and Cherry Street is an intersection the poses a hazard to cyclists, pedestrians and automobiles traveling on 19th Ave crossing Cherry St.  The hill makes sightlines poor for both cars driving along Cherry and people crossing Cherry on 19th in various travel modes.  Multiple car crashes have occurred here over the past few years and my family has had a series of close encounters with cars while crossing on foot.  Cars often speed on this road making the issue all the more dangerous.   19th is also a highly traveled cycling route.  As children become more and more prevalent in this neighborhood, this hazard becomes all the more worrisome.","idea":"Add an overhead, perhaps cable hung, flashing yellow light and maybe a crossing sign they are high enough off ground to be visible from bottom of hill on Cherry st (bottom of hill is approximately at intersection with 20th Ave) to alert drivers to frequent crossings that are not always visible to drivers from the bottom of the hill when traveling westbound on Cherry Street.  ","latitude":47.607992,"longitude":-122.307648,"location":"19th Ave and Cherry Street","type":"Crossing Improvements","dept":"SDOT","benefits":"The neighbors walking dogs, walking children and just walking themselves.  Cylists that use 19th as a North-South travel corridor through city.  Drivers crossing Cherry St on 19th and drivers traveling along Cherry whose vision of cross traffic at 19th is hampered by geometry of hill.","dist":3,"neigh":"Squire Park"},{"status":"Advance to Further Review","review1":16,"review2":14.0,"avg":15.0,"initial":null,"no":"17-374","combined":null,"title":"Crossing improvements @ I-5 exit onto Olive Way","need":"It is scary to cross the street at the Olive Way northbound freeway exit from I-5 because cars are coming around the curve with a short visibility line and going fast as they exit the freeway. It's hard to tell if cars have seen you (especially when walking west) and this means I wait until I'm sure they are stopping, and they think I'm just standing there and drive past. ","idea":"Flashing lights that I could press to make sure cars were going to see the crosswalk and stop (like the ones on the northbound freeway entrance lane just across Olive Way)","latitude":47.61643,"longitude":-122.32845,"location":"northbound exit from I-5 onto Olive Way","type":"Crossing Improvements","dept":"SDOT","benefits":"pedestrians and cars by making the pedestrians easier to see and having a clear way to signal intention to cross","dist":3,"neigh":"Capitol Hill"},{"status":"Advance to Further Review","review1":15,"review2":14.0,"avg":14.5,"initial":null,"no":"17-381","combined":null,"title":"Improved crossing at 19th Ave at E. Denny Way","need":"It is difficult to cross the street due to high traffic volumes and drivers not yielding to pedestrians.   I use Denny Way as a bike and walking route to and from my child's daycare and its difficult to cross at 19th Ave.  This corner is also a school bus stop for students attending TOPS K-8 school.  ","idea":"The crossing distance might be reduced by using curb bulbs.  Crosswalks could be painted.  Warning signs or lights (flashing beacons) might help. ","latitude":47.61849,"longitude":-122.3074,"location":"19th Ave at E Denny Way","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians travelling between Madison St. corridor and Capitol Hill, students and parents using the school bus stop for TOPS K-8, pedestrians accessing the Metro Bus stop, and cyclists following the signed route between Capitol Hill and the Central Area Neighborhood Greenway.","dist":3,"neigh":"Capitol Hill"},{"status":"Advance to Further Review","review1":15,"review2":14.0,"avg":14.5,"initial":null,"no":"17-382","combined":"With 17-381","title":"Improved crossing at 19th Ave at E. Denny Way","need":"Cars are speeding on 19th Ave E. between Madison and Thomas.  Parked cars and a sloped street make it hard for cars and pedestrians on the East side of 19th to see one another at Denny Way E.  This intersection is near a school and a park, and is a pedestrian thoroughfare between East Capitol Hill and the new Link Station.  ","idea":"A raised cross walk\/speed bump crossing across 19th Ave E. much like MLK and Alder.    -or-  Flashing signs and a painted cross walk.","latitude":47.618501,"longitude":-122.3074,"location":"19th Ave E and Denny Way E","type":"Crossing Improvements","dept":"SDOT","benefits":"Children walking to Meany Middle School  Pedestrians walking to the Link Light Rail  Pedestrians walking to Miller Community Center Playfield","dist":3,"neigh":"Capitol Hill"},{"status":"Advance to Further Review","review1":19,"review2":18.0,"avg":18.5,"initial":null,"no":"17-394","combined":"With 17-395","title":"Improve crossing near Miller Park","need":"At 21st Ave e and john st there are two crosswalks that provide access to miller park. But cars very frequently don't stop and go way too fast. We really need those push-button light up signs like the ones at 21st Ave e and aloha. They are so effective. ","idea":null,"latitude":47.62023,"longitude":-122.30472,"location":"21st Ave E and John St","type":"Crossing Improvements","dept":"SDOT","benefits":"Families and individuals attempting to access miller park and surrounding bus stops.","dist":3,"neigh":"Capitol Hill"},{"status":"Advance to Further Review","review1":19,"review2":18.0,"avg":18.5,"initial":null,"no":"17-395","combined":null,"title":"Crossing improvements near Miller Park","need":"The Central Area Neighborhood Greenway crosses E John St at 21st Ave E, next to Miller Park and Meany Meddle School. Although new crosswalks were installed as part of the greenway project, many drivers still fail to yield to people walking and riding bikes across this intersection.","idea":"There is already an NSF grant that will provide curb bulbs at this intersection to narrow it somewhat. Adding some kind of signal, either flashing lights or a pedestrian signal, is needed to indicate to people driving that they need to yield to people trying to cross the street. Similar signals were installed elsewhere on the Greenway (RRFBs at Aloha, pedestrian half-signal at Union)","latitude":47.62023,"longitude":-122.30472,"location":"E John St & 21st Ave E, southeast corner of Miller Park","type":"Crossing Improvements","dept":"SDOT","benefits":"People walking and bicycling along the greenway, students attending Meany Middle School, people using the Miller Park playfield and Community Center","dist":3,"neigh":"Capitol Hill \/ Miller Park"},{"status":"Advance to Further Review","review1":14,"review2":17.0,"avg":15.5,"initial":null,"no":"17-411","combined":null,"title":"Install curb-ramps near transit connections by Volunteer Park","need":"There is a walking path leading into Volunteer Park at 15th Ave. E and E. Prospect, and there are bus stops on either side of 15th providing the closest transit access to Volunteer Park.  But there is no curb ramp to allow people with mobility limitations to access the path, and traffic moves very fast along 15th.  When I took my mother-in-law on the bus to visit the park, I had to take her on a big detour out into the street in order to get to the path.  This should be a welcoming, safe, accessible entrance to the park for transit users and people with mobility limitations.  This will also most likely be the north end of the soon-to-be-constructed Ridge Route Neighborhood Greenway.","idea":"Install curb bulbs with curb ramps at the crosswalk across 15th to shorten the crossing distance, make people more visible when attempting to cross the street, and slow traffic along 15th.  The path could also be improved to provide a more welcoming entrance to the park.","latitude":47.62839,"longitude":-122.31253,"location":"Intersection of 15th Ave. East and East Prospect Street","type":"Accessibility Improvements","dept":"SDOT","benefits":"People with mobility limitations visiting Volunteer Park; anyone using transit to visit Volunteer Park or to access the neighborhood; anyone walking across 15th Ave. East at Prospect.","dist":3,"neigh":"Capitol Hill"},{"status":"Advance to Further Review","review1":11,"review2":19.0,"avg":15.0,"initial":"Would require KC Metro coordination. ","no":"17-424","combined":null,"title":"Improve busstop @ 26th & Walker","need":"The bus stop nearest the building in which I live lacks a curb, making it practically unusable for anyone wishing to board low-floor METRO busses there on weekends, due to the fact METRO uses diesel coaches  with older boarding ramps that are too steep for anyone using a manual wheelchair or walker to negotiate.  During the week, this is not a problem, since 40-foot trolley coaches are used on the route--and those have much easier ramps to negotiate.","idea":"Work with METRO's Facilities Department to install curbing at this location, unless METRO has decided to use the new trolley coaches on the weekends (which is possible, since those have battery power, allowing them to travel up to three miles without having to draw power from the overhead wires).","latitude":47.583505,"longitude":-122.29976,"location":"26th and Walker (the Route #4 layover point)","type":"Accessibility Improvements","dept":"SDOT","benefits":"Anyone who uses the Route #4, especially those people using manual     wheelchairs and walkers--and this community has a large number of both!","dist":3,"neigh":"North Rainier"},{"status":"Advance to Further Review","review1":16,"review2":12.5,"avg":14.25,"initial":null,"no":"17-434","combined":null,"title":"Crossing improvements near Gas Works Park","need":"SITE: Gasworks Park neighborhood - You've built a playground for the garbage plant at 35th, and you're planning another playground at Gasworks - this means more families trying to walk across N. 34th St, and trying to cross N. Northlake Way... and people have already been hit.    PROBLEM: Pedestrian crossings leading to these playgrounds (difficulty crossing N. Northlake Way,difficulty crossing N. 34th St). People think that either N. 34th, or N. Northlake Way, are highways - instead of residential streets that people HAVE to cross - they go 50mph OFTEN. I live near there, and even though they repainted the crosswalks (THANK YOU), I see cars zoom AROUND kids & dog-walkers who are in the crosswalk.     On. N. Northlake Way at sunset (when most people arrive & leave Gasworks), the sun blinds the drivers (heading north). And at night, there's no streetlighting near the 2 crosswalks.     Also one crosswalk on N. Northlake Way (near Meridian, at south end of Gasworks Park ) is on a BLIND CURVE with no sign indicating upcoming crosswalk after curve or to slow down (heading north).     There also needs to be a crosswalk on N. Northlake Way at the north end of Gasworks Park (by Wooden Boat School) - people exit the park there, and jaywalk there. (No one expects anyone to exit at the N. Northlake crosswalk near Densmore, since people don't have a path to exit the park there).","idea":"Using even one of these ideas would help:    1) Put temporary speed-radar signs anywhere along N. Northlake Way or the upper route, on N. 34th, discourage speeders - even this would help!     2) Signs warning of pedestrian traffic 2 \"blocks\" ahead on N. Northlake Way near Gasworks.    3) At Gasworks, REMOVE crossing at blind corner (near Meridian) & remove the crossing midway down (near Densmore) - people don't naturally enter the park at those two points! Move both crosswalks further north.   Move the \"blind corner\" to be at parking lot entrance instead (nearer to Burke St), where people expect it - and where cars have to slow down anyway. Put the north crossing at the Wooden Boats Ctr (near Woodlawn Ave N.), where people come out of the park (less setting sun in the eyes?)    4) Could you make both crosswalks (on N. Northlake Way near Gasworks) into flashing-lights crosswalks? A LOT of visitors legitimately use Gasworks Park at night, for exercise, astronomical events, holiday shows, and just to admire the cityscape lights!    5) Please also consider a few flashing-light crosswalks on N. 34th St. Two good places on N. 34th would be: by the Essential Bakery (next to garbage plant playground), and on N. 34th leading to Gasworks (A crosswalk at Burke & N. 34th would be a good idea, since Meridian & N.34th is also a blind corner, in addition to blinding setting sun.)        ","latitude":47.647287,"longitude":-122.337486,"location":"Gasworks Park - pedestrian crossings leading to park ","type":"Crossing Improvements","dept":"SDOT","benefits":"EVERYONE who walks to OR drives near Gasworks (It is even scary driving - you try to stop at the crosswalk for a kid, but the driver behind you on the blind curve had NO IDEA there was even a crosswalk!). Also important for crowd management during  Seattle's biggest holiday gathering (4th of July).","dist":4,"neigh":"Fremont"},{"status":"Advance to Further Review","review1":16,"review2":13.0,"avg":14.5,"initial":null,"no":"17-439","combined":null,"title":"Install curb-bulbs on NE 40th St between Stone Way and Wallingford Ave","need":"Difficult to cross NE 40th St - high volume\/speed of cars","idea":"Build bulbouts along NE 40th St between Stone Way and Wallingford Ave. This will help pedestrians be more visible to NE 40th traffic, narrow the crossing distance, and slow traffic. These streets are key crossing locations for students traveling to and from Hamilton Middle School. More landscaping would be great as well--the road is very wide there so cars tend to speed along that stretch.","latitude":47.65566,"longitude":-122.33624,"location":"NE 40th St between Stone Way and Wallingford Ave","type":"Crossing Improvements","dept":"SDOT","benefits":"Students at Hamilton Middle School and tons of pedestrians and transit riders who must cross NE 40th St.","dist":4,"neigh":"Wallingford"},{"status":"Advance to Further Review","review1":18,"review2":11.5,"avg":14.75,"initial":null,"no":"17-443","combined":null,"title":"Add crosswalk at Roosevelt & 41st","need":"Although Seattle pedestrian code implies it's legal to cross without a crosswalk on 41st & Roosevelt, it feels illegal. It should be clear both to pedestrians and cars that pedestrians can cross at 41st (once the construction is done) and putting the crosswalk on the southern side of 41st would encourage pedestrians to cross further away from traffic turning from 42nd giving cars more time to react if pedestrians are crossing. Currently pedestrians frequently cross illegally between 41st and 42nd (this was true before the construction as well).","idea":"After the construction is completed at 41st & Roosevelt, add a crosswalk at 41st and Roosevelt. ","latitude":47.6569,"longitude":-122.31782,"location":"Roosevelt and NE 41st St","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians. Cyclists who cross as pedestrians. ","dist":4,"neigh":"U District"},{"status":"Advance to Further Review","review1":18,"review2":18.0,"avg":18.0,"initial":null,"no":"17-456","combined":null,"title":"Improve crossing at N. Midvale and Greenlake Way","need":"No safe way to cross this very wide 4 lane section of Greenlake way that cuts off neighborhoods from the park and zoo and schools with no safe way for pedestrians to cross.  The traffic has increased and promises to continue to increase with up zoning., Lincoln high school is being reactivated which increases students use of this path.  Currently children who attend St. Benedict a few blocks away are being  driven to school because it is too dangerous to cross at this intersection on foot. St Benedict uses the park for cross country events with no safe way to have children walk from the school to upper woodland park. The 44 bus to the UW runs south of here so students and faculty need to cross this intersection to get over to 45\/46 ave to catch the bus . Heavy pedestrian use with no safe way to cross this street","idea":"Place a crosswalk at Midvale and Greenlake way with flashing beacons to alert traffic of this crosswalk.  There used to be a crosswalk at this intersection about many years ago.","latitude":47.6633,"longitude":-122.34375,"location":"Midvale Ave North  and Greenlake way","type":"Crossing Improvements","dept":"SDOT","benefits":"School children, parents, neighbors, bus riders.  Pedestrians trying to access the park and zoo who live south of Greenlake way. Neighborhoods cut off by Greenlake way who need to reach schools, buses and shopping.  Any pedestrian that has feared for their safety who currently must cross without a crosswalk or light across several lanes of fast moving traffic. As is true in many places the volume of traffic on Greenlake way has increased significantly over the years making any safe breaks in that traffic very slim","dist":4,"neigh":"Wallingford "},{"status":"Advance to Further Review","review1":18,"review2":11.0,"avg":14.5,"initial":null,"no":"17-459","combined":null,"title":"Add lighting @ University Playfield","need":"There is a lack of open space in the U District and the parks we do have aren't very nice \/ safe","idea":"University Playfield needs to be lit up at night. No one uses the space after 4 pm because its seen as dangerous. Friends of mine take indirect walking routes home after dark to avoid the park as people have been assaulted there.","latitude":47.664265,"longitude":-122.319473,"location":"University Playfield","type":"Lighting","dept":"Parks","benefits":"Kids, residents","dist":4,"neigh":"U-District "},{"status":"Advance to Further Review","review1":15,"review2":15.0,"avg":15.0,"initial":null,"no":"17-461","combined":null,"title":"Crossing Improvements @ NE 55th & 30th Ave NE","need":"NE 55th St. is a difficult and dangerous street to cross. There are no marked crosswalks for a 9 block stretch (between 34th Ave NE and 25th Ave NE), despite an active retail area between 28th and 30th Ave. NE. This is a wide road with cars parked only intermittently, leading to fast traffic. Drivers rarely stop for people to cross the street. It has been the spot of at least one collision leading to serious injuries for a woman crossing the street (http:\/\/www.ravennabryant.org\/2013\/11\/hit-and-run-on-ne-55th\/). Hills and land use (such as Calvary Cemetery) make it even more challenging for people to access a safe crossing.     Crossing anywhere this stretch of NE 55th St. is a challenge, but this proposal focuses on improving the crossing at 30th Ave. NE. This is an important intersection because it is halfway between lights (at 25th and 35th Ave. NE). It is located in a retail core. Some think of it as the \"Queen Mary Crossing,\" and I can say that just this week when my aging mother in law took my 5 and 7 year old daughters to a tea party I was terrified thinking of them crossing here to get to the gift shop and again to the bus stop. This is on the edge of the cemetery, and is a prime corridor for people walking and biking to Bryant or beyond from U Village and the Burke Gilman trail. Parked cars make it challenging for people driving to see those waiting to cross, especially at the Z-shaped intersection of 30th Ave. NE, where people are attempting to cross from a sidewalk ramp hidden in between cars, rather than at a street corner. There are multiple preschools and child-centered businesses on or adjacent to NE 55th, and so parents commonly need to park on 55th and cross this busy street with young children. (Memorably, when my kids wanted to participate in Bike to School day at their school, we stood on the corner watching cars zoom by for minutes, and were finally only able to walk our bikes across the street when a stranger flagged down traffic and acted as an ad hoc crossing guard.) ","idea":"1) Curb Bulbs  There is already a curb ramp in front of Jack and Jerome at the intersection of NE 55th St. and 30th Ave NE, but anyone waiting to cross there is hidden by parked cars. I would like to see the two adjacent parking spots removed and the creation of a curb bulb. If this were implemented with a lower cost paint\/barrier curb bulb, a design like teacups might be painted on to incorporate local character at the \"Queen Mary Crossing.\"     2) Marked Crosswalks  Because many, especially those biking, cross on the east side of the intersection, two painted crosswalks at both the east and west side where 55th and 30th intersect are key to making this crossing successful.     3) Rectangular Rapid Flashing Beacon  A RRFB that could be triggered from the sidewalk or by a person on a bike (heading north on 30th) could add another element of visibility. ","latitude":47.6685,"longitude":-122.29506,"location":"NE 55th St. and 30th Ave. NE. Because the 30th jogs here, there are 2 intersections of these roads, and this focuses on the western portion, e.g. by the Queen Mary Tea Room not by the restaurant Pair.","type":"Crossing Improvements","dept":"SDOT","benefits":"An improved crossing at 30th Ave. NE would benefit residents and visitors in the Bryant\/Ravenna neighborhoods, stores and restaurants on NE 55th St, Blakely, and University Village, and students and families who walk or bike to schools such as Bryant Elementary and Eckstein Middle School. This would also benefit everyone who drives on NE 55th St, by making people crossing easier to see and by calming traffic.","dist":4,"neigh":"Bryant"},{"status":"Advance to Further Review","review1":16,"review2":14.0,"avg":15.0,"initial":null,"no":"17-462","combined":null,"title":"Improvements near Bryant Elementary","need":"There have been a number of near misses at this intersection between pedestrians, including children and their parents walking to school at Bryant Elementary in the past months. These often involve cars that are trying to turn, which then do not anticipate\/see pedestrians in the crosswalk. Increased traffic in the neighborhood, combined with new bell times that put Bryant students in the thick of morning rush hour, have brought to light safety issues that were not apparent in previous years. A neighborhood committee consisting of several Bryant parents has formed to explore ways of increasing safety at this intersection.","idea":"Dedicated turn lanes, posting speed limits, and\/or highlighting crosswalks, either with illumination, or by raising the crosswalks, or by having orange flags that are placed in canisters on one end of the crosswalk to the other","latitude":47.66851,"longitude":-122.29021,"location":"35th Ave NE\/NE 55th St.","type":null,"dept":"SDOT","benefits":"Bryant students & families, residents","dist":4,"neigh":"Bryant"},{"status":"Advance to Further Review","review1":16,"review2":17.0,"avg":16.5,"initial":"Depending upon the location will need to coordinate with Parks & SDOT, inside Magnusen Park, historic overlay district","no":"17-485","combined":null,"title":"Pedestrian Improvements at Magnuson Park, Solid Ground Campus, SDOT access road \"A\" St","need":"There are unnecessary obstacles for pedestrians, disabled or otherwise to cross \"A\" St. from the apartments to the sidewalk where there is no curb ramp for ADA access.","idea":"Install a crosswalk at the bottom of the wheelchair ramp providing a clearly marked safety crossing, and install a curb ramp on the west side of \"A\" street.   These additions will improve safety and access to and from the west entrance of Solid Ground's \"Phyllis Gutierrez Kenney Place\" at 6951 62nd Ave NE, as well as provide a safe crossing point for residents and the public to cross \"A\" street.","latitude":47.678999,"longitude":-122.262891,"location":"Magnuson Park, Solid Ground Campus, SDOT access road \"A\" St, at the west entrance's ADA ramp of the Phyllis Gutierrez Kenney Place apartments (6951 62nd Ave NE).","type":"Accessibility Improvements","dept":"SDOT","benefits":"Primarily this project would serve the disabled residents of Phyllis Gutierrez Kenney Place.  Secondary consideration to the public at large and remaining residents of Solid Ground.","dist":4,"neigh":"Magnuson Park"},{"status":"Advance to Further Review","review1":18,"review2":16.0,"avg":17.0,"initial":"Depending upon the location will need to coordinate with Parks & SDOT, inside Magnusen Park, historic overlay district","no":"17-490","combined":null,"title":"Crosswalk Installation at NE 74th St. and (approx.) 64th Ave NE","need":"There are not enough painted crosswalks on the streets inside Magnuson Park, which has many streets and a lot of car traffic.  It's a dangerous place for all pedestrians, which includes over 100 children who live inside the park in the low-income housing and hundreds of visiting children who attend camps, classes, and sporting events at the park.      The few crosswalks that exist are in poor condition, either because they were never made wide enough to be noticeable, and\/or have not been repainted in many years","idea":"The crosswalk at the corner of NE 74th St. and (approx.) 64th Ave NE, which is the main route between the Jr. League children's playground and Magnuson Community Garden, needs to be repainted and be much wider.   Its very old striping was never visible enough to vehicle traffic even when it was originally painted, and cars going to and from the W-6 parking lot and the dog park frequently \"drift\" through that 4 way stop without stopping.  It is a very dangerous crosswalk for all pedestrians as it is now, but with children and families as its main users, the danger is even more of a safety threat.    Painted crosswalks should be added, or crosswalks enlarged and repainted, at the following intersections where pedestrians frequently cross and cars frequently exceed the speed limit and\/or run the stop signs:  * NE 65th St. and 62nd Ave NE  * NE 65th St. and Sports Field Drive  * NE 65th St. and Lake Shore Drive  * 62nd Ave NE and NE 70th St.  * 62nd Ave NE and NE 74th St.  * NE 74th St. and 63rd Ave NE","latitude":47.681126,"longitude":-122.264514,"location":"Magnuson Park","type":"Crossing Improvements","dept":"Parks","benefits":"All pedestrians and bicycle riders who visit Magnuson Park or live in the park ","dist":4,"neigh":"Magnuson Park"},{"status":"Advance to Further Review","review1":16,"review2":null,"avg":16.0,"initial":"Depending upon the location will need to coordinate with Parks & SDOT, inside Magnusen Park, historic overlay district","no":"17-491","combined":"With 17-485","title":"Crossing Improvements at NE 74th St. and (approx.) 64th Ave NE","need":"There are unnecessary obstacles for pedestrians, disabled or otherwise to cross \"A\" St. from my apartments to the sidewalk where there is no curb ramp for ADA access.","idea":"Install a crosswalk at the bottom of the wheelchair ramp providing a clearly marked safety crossing for \"A\" St., and install a curb ramp on the west side of \"A\" street.   These additions will improve pedestrian safety and access to and from the west entrance of Solid Ground's \"Phyllis Gutierrez Kenney Place\" at 6951 62nd Ave NE.  ","latitude":47.681357,"longitude":-122.261577,"location":"Magnuson Park, Solid Ground Campus, SDOT access road \"A\" St, at the west entrance's ADA ramp of the Phyllis Gutierrez Kenney Place apartments.","type":"Accessibility Improvements","dept":"SDOT","benefits":"Primarily this project would serve the disabled residents of Phyllis Gutierrez Kenney Place.  Secondary consideration to the public at large and remaining residents of Solid Ground.","dist":4,"neigh":"Magnuson Park"},{"status":"Advance to Further Review","review1":14,"review2":16.0,"avg":15.0,"initial":null,"no":"17-495","combined":null,"title":"Improve crossing at 35th Ave NE & NE 80th St","need":"The crosswalk across 35th Ave NE at NE 80th St. does not have adequately visible signing nor is it adequately lit. I often see cars fly by at high speeds while pedestrians are waiting to cross. ","idea":"Install a raised and\/or blinking light crosswalk.","latitude":47.686677,"longitude":-122.293899,"location":"32 Ave NE and NE 80th St","type":"Crossing Improvements","dept":"SDOT","benefits":"Many pedestrians who use this crosswalk. ","dist":4,"neigh":"Wedgwood"},{"status":"Advance to Further Review","review1":11,"review2":18.0,"avg":14.5,"initial":null,"no":"17-499","combined":null,"title":"Traffic Calming near Olympic View Elementary","need":"Cars drive to fast past residential houses and past a school. Likely because it is an alternate route when I-5 is jammed up.","idea":"Speed sign, road diet, traffic cams, anything that will slow traffic on this arterial.","latitude":47.69818,"longitude":-122.323116,"location":"5th Ave NE adjacent to Olympic View Elementary, although the speed issue is probably the whole length of 5th Ave NE from the Northgate Mall south to Banner Way NE.","type":"Traffic-Calming","dept":"SDOT","benefits":"residents and schools","dist":5,"neigh":"Maple Leaf"},{"status":"Advance to Further Review","review1":16,"review2":11.0,"avg":13.5,"initial":null,"no":"17-515","combined":null,"title":"Crossing improvement @ Ravenna & NE 98th St","need":"Currently, NE 98th St. and Ravenna is a 2-way stop only on NE 98th.  This is an angled corner, mostly blind to traffic going E-W on 98th, fast traffic on Ravenna, and troughs on both sides of Ravenna.  There is a dip on NE 98th between Lake City Way and Ravenna that makes it particularly difficult to see traffic on Ravenna.  There is a Metro bus stop at Lake City Way\/NE 98th, and residents and students who go to Waldorf, Nathan Hale, Jane Addams, and possibly John Rogers all use this pedestrian area.  There have been serious bicycle\/vehicle accidents at this location.  THERE SHOULD BE A 4-WAY STOP AT THIS INTERSECTION.","idea":"Add stop signs on Ravenna N-S bound at NE 98th Street (where signs already exist).","latitude":47.70025,"longitude":-122.3013,"location":"Ravenna at NE 98th St.","type":"Crossing Improvements","dept":"SDOT","benefits":"Vehicles, pedestrians, and other travelers (bicycles, etc.) at this low-visibility intersection.","dist":5,"neigh":"Meadowbrook"},{"status":"Advance to Further Review","review1":20,"review2":19.0,"avg":19.5,"initial":null,"no":"17-524","combined":null,"title":"Walkway improvements near Viewlands Elementary","need":"Dangerous area near school. There is no walkway on the East side of 3rd Avenue across from Viewlands Elementary. People park and cross across traffic, or walk along the busy street to get to marked crosswalks. This is a big issue and very dangerous. Neighbors, the Broadview Neighborhood Council, the PTA, the Viewlands school administration, have all expressed interest and support for this project.","idea":"Could be a simple asphalt walkway, or a full curb-gutter sidewalk.","latitude":47.70696,"longitude":-122.36081,"location":"between 105th and 107th on 3rd Ave NW","type":"Walkways","dept":"SDOT","benefits":"Children, parents, teachers, caregivers","dist":5,"neigh":"Broadview"},{"status":"Advance to Further Review","review1":17,"review2":17.0,"avg":17.0,"initial":null,"no":"17-530","combined":null,"title":"Crossing improvements near Hazel Wolf school.","need":"Make it safer for kids attending Hazel Wolf School","idea":"Traffic lights and crosswalks at NE 117th and Pinehurst Way near Hazel Wolf school.","latitude":47.71397,"longitude":-122.31286,"location":"NE 117th and Pinehurst Way ","type":null,"dept":"SDOT","benefits":" Beneficiaries would be students and residents of the area.","dist":5,"neigh":"Pinehurst"},{"status":"Advance to Further Review","review1":16,"review2":17.0,"avg":16.5,"initial":null,"no":"17-531","combined":"With 17-530","title":"Crossing improvements on Pinehurst Way near Hazel Wolf school.","need":"Pinehurst Way is a high speed corridor passing the school; NE 115th is part of a proposed Greenway connection between Lake City and Northgate. ","idea":"Traffic lights and crosswalks at NE 115th Street and Pinehurst Way for the Hazel Wolf School","latitude":47.71397,"longitude":-122.31286,"location":"NE 115th Street and Pinehurst Way ","type":null,"dept":"SDOT","benefits":"students, pedestrians, and bicycle riders","dist":5,"neigh":"Pinehurst"},{"status":"Advance to Further Review","review1":8,"review2":18.0,"avg":13.0,"initial":null,"no":"17-537","combined":null,"title":"Traffic-calming on Pinehurst Way","need":"We are seeing a dramatic increase in the amount of traffic and the speed at which they drive down our neighborhood street. There are a lot of people who walk their dogs, ride their bikes or just go for a walk on our street. We have no sidewalks for these people so they are walking in the traffic.  When the city reduced Pinehurst Way and 15th Ave. NE. down to one lane of traffic in each direction, a lot of morning and evening commuters will use our street to avoid the backups that happen at the stoplight at 15th Ave. NE. and NE. 125th street. Because these drivers are trying to get out ahead of the traffic at the 15th and 125th  stoplight intersection, they will speed down our street.","idea":"First and foremost is to try and slow this increased traffic down to a safe speed. Speed humps or Chicanes are a good option. Our neighborhood preference is the Chicanes such that only one car can go through the Chicane at a time. This not only slows the traffic but would also discourage leaving the main road ( 15th Ave. NE.) for our residential street.","latitude":47.71821,"longitude":-122.31013,"location":"Pinehurst Way and 17th Ave. NE. between NE. 123th street and NE. 125th Street.  ","type":"Traffic-Calming","dept":"SDOT","benefits":"Neighbors living on these streets, walker, runners, bicyclist and dog walkers.","dist":5,"neigh":"Pinehurst"},{"status":"Advance to Further Review","review1":16,"review2":10.0,"avg":13.0,"initial":null,"no":"17-570","combined":null,"title":"Install a flashing beacon @ 35th Ave NE & NE 130th St","need":"For safe crossing of kids who attend the school nearby, or people in general who go to the Food Bank, the community clinic, and the main grocery store and the Lake City's business core.  A lot of drivers don't respect the marked crossing, a lady was run over recently and suffered fractures. ","idea":"Install a flashing beacon @ 35th Ave NE & NE 130th St","latitude":47.722967,"longitude":-122.290848,"location":"35th Ave NE and NE 130th St","type":"Crossing Improvements","dept":"SDOT","benefits":"All the people mentioned above, including elders and people with disabilities","dist":5,"neigh":"Lake City"},{"status":"Advance to Further Review","review1":20,"review2":14.0,"avg":17.0,"initial":"Scope to budget","no":"17-576","combined":null,"title":"Improve walkability near Broadeview-Thompson K-8","need":"NW 132nd Street is a major pedestrian thoroughfare for kids accessing Broadview Thomson and the conditions are very dangerous. 65% of cars go more than 5 mph over the speed limit, and 17% go more than 10 mph over. Ditches line the roadway so elementary students are forced to walk in the street. The problem will worsen when a pending housing project displaces a parking lot and forces cars to park on the street and push pedestrians further into the roadway.","idea":"Sidewalks along the stretch of NW 132nd Street between Greenwood and 3rd Ave NW","latitude":47.724988,"longitude":-122.3566,"location":" NW 132nd Street between GreenwoodAve N  and 3rd Ave NW","type":"Walkways","dept":"SDOT","benefits":"Students walking to Broadview Thomson, pedestrians accessing public transit (especially bus lines 5 and 28), and the deaf individual who lives on that stretch of street.","dist":5,"neigh":"Broadview"},{"status":"Advance to Further Review","review1":13,"review2":16.0,"avg":14.5,"initial":null,"no":"17-588","combined":null,"title":"Crossing Improvements @ 30th Ave NE & NE 137th St","need":"Unsafe crossing 30th Ave NE at NE 137th where there is a bus stop.","idea":"RRFB at the crosswalk at NE 137th and 30th Ave NE","latitude":47.72792,"longitude":-122.29643,"location":"30th Ave NE and NE 137th Street","type":"Crossing Improvements","dept":"SDOT","benefits":"People living in Little Brook and Olympic Hills neighborhoods; kids walking to and from library; students who will be at newly built Olympic Hills Elementary","dist":5,"neigh":"Lake City"},{"status":"Advance to Further Review","review1":10,"review2":16.0,"avg":13.0,"initial":null,"no":"17-598","combined":null,"title":"Basketball court (at least half) at Little Brook Park","need":"Young and adult residents from this area (one of the most dense populated in the city, surrounded by many apartment buildings) would greatly benefit from having a place where they can practice a sport. Especially considering that dog owners are constantly leaving the park contaminated with feces, and drug users have taken over the park, both of those factors pushing families away. ","idea":"Basketball court (at least half) at Little Brook Park","latitude":47.731385,"longitude":-122.293907,"location":"Little Brook Park (14043 32nd Ave NE)","type":"Park Equipment","dept":"Parks","benefits":"Teens and families in general.","dist":5,"neigh":"Lake City"},{"status":"Advance to Further Review","review1":20,"review2":10.0,"avg":15.0,"initial":null,"no":"17-599","combined":null,"title":"Traffic-calming on N 143rd St, between Greenwood and Linden N","need":"There are currently 1,800 cars using N 143rd St daily.  The road is not wide and the traffic tends to speed down the road, creating a safety hazard.  There is a great deal of foot traffic on this road causing a worse hazard.","idea":"Install 2 raised crosswalks","latitude":47.732319,"longitude":-122.350086,"location":"N 143rd St between Greenwood and Linden N.","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians and children.","dist":5,"neigh":"Broadview"},{"status":"Advance to Further Review","review1":20,"review2":16.0,"avg":18.0,"initial":null,"no":"17-611","combined":null,"title":"Crossing Improvements @ 1st Ave NW & N. 36th","need":"A stoplight OR lighted crosswalk at N 36th Street and 1st Ave NE.  It is very difficult to navigate this intersection, both for cars and for pedestrians.  Cars going eastbound on Leary way come around the curve onto N 36th at a scary pace.  Pedestrians are especially at risk.","idea":"Ideally, a traffic light would improve safety the best.  We are especially impacted by large trucks working on the Siphon Project that will continue on for a few more years.    A crosswalk with flashing lights would at least call attention to pedestrians trying to cross N 36th in a truck-heavy and short sight distance portion of road.","latitude":47.65296,"longitude":-122.35766,"location":"North 36th Street & 1st Avenue NW","type":"Crossing Improvements","dept":"SDOT","benefits":"All users of this intersection, plus added convenience and safety for King County Metro Siphon Project.","dist":6,"neigh":"Fremont"},{"status":"Advance to Further Review","review1":16,"review2":17.0,"avg":16.5,"initial":null,"no":"17-631","combined":null,"title":"Crossing improvments @ N 50th Street at Dayton Ave N.","need":"Cars speed on N 50th St heading both East and West as it crosses Dayton Ave N.  The crosswalk at Dayton Ave N is used by KapKa Cooperative School multiple times daily during the week, as well as community members as the enter the zoo and the War Memorial Garden Park.  Even with bright flags and direct eye contact with drivers, it is often difficult to get cars to stop at that crosswalk.   ","idea":"Installation of flashing lights at that crosswalk to improve visibility.  Also, repaint the crosswalk lines on the street.  ","latitude":47.66505,"longitude":-122.35271,"location":"Crossing N 50th Street at Dayton Ave N.","type":"Crossing Improvements","dept":"SDOT","benefits":"School children from KapKa Cooperative School and NW Montessori School.  Community members who park in the neighborhood as they approach the park and the Woodland Park Zoo. ","dist":6,"neigh":"Woodland Park"},{"status":"Advance to Further Review","review1":17,"review2":15.0,"avg":16.0,"initial":null,"no":"17-632","combined":null,"title":"Safer crossing at N 50th St & Whitman Ave","need":"The crosswalk at Whitman and N. 50th is bisected by a concrete barrier for the bridge over 50th for Aurora Ave.  Drivers heading eastbound cannot see around the barrier to look for pedestrians.  The stop sign is not very visible and I have almost been hit several times by cars that do not even slow down at this intersection","idea":"Blinking crosswalk sign","latitude":47.66506,"longitude":-122.34604,"location":"N 50th Street and Whitman Avenue. Directly across from large N. 50th street parking lot for upper Woodland Park","type":"Crossing Improvements","dept":"SDOT","benefits":"All pedestrians trying to cross the street to Woodland Park and the Zoo","dist":6,"neigh":"Woodland Park"},{"status":"Advance to Further Review","review1":18,"review2":18.0,"avg":18.0,"initial":null,"no":"17-635","combined":null,"title":"Crossing improvement @ Leary Ave NW & 20th NW","need":"The intersection at Leary Ave and 20th Ave in Ballard is super useful for neighborhood walkability due to the way the streets angle, but crossing Leary Ave at that intersection feels dangerous. Motorists have a long, straight shot, and no light, so you have to be really careful to make sure they see you and stop before crossing at the crosswalk.","idea":"Could be solved by installing a flashing beacon, at the very least. A stoplight here could be interesting, in that it would help people merging from 20th ave at this weird intersection. If a stoplight were installed it would probably make sense to have it green when going straight on Leary way, changing only on pedestrian input or pressure sensors on 20th ave.","latitude":47.66668,"longitude":-122.38217,"location":"Leary Ave and 20th Ave in Ballard","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians and businesses in Old Ballard","dist":6,"neigh":"Ballard"},{"status":"Advance to Further Review","review1":18,"review2":18.0,"avg":18.0,"initial":null,"no":"17-636","combined":"With 17-635","title":"Crossing improvement @ Leary Ave NW & 20th NW","need":"It's scary to cross the intersection of Leary Ave, 20th Ave NW, and (kinda) Vernon PL.","idea":"Put in a stop light with signals for pedestrian traffic","latitude":47.66668,"longitude":-122.38217,"location":"Leary Ave NW and 20th Ave NW","type":"Crossing Improvements","dept":"SDOT","benefits":"The many people who walk in that area -- people who go to Olympic Athletic Club, patrons of Senor Moose, apartment residents nearby, etc.","dist":6,"neigh":"Ballard"},{"status":"Advance to Further Review","review1":18,"review2":15.0,"avg":16.5,"initial":null,"no":"17-642","combined":null,"title":"Crossing Improvements near the Ballard Locks","need":"The set of crosswalks where Market St  splits off at NW 54th St, just east of the Locks, are dangerous to cross. The paint has faded and traffic doesn't have adequate sightlines to slow down easily for pedestrians. Additionally, there is a dead space in the middle of the road (in front of the Taco Time sign) that would be ideal for a planted space that welcomes visitors to the Locks area and drive toward Golden Gardens and Shilshole Marina. This intersection is near where the new Nordic Heritage Museum is being built and in addition to being a highly used\/necessary pedestrian crossing area, it would be ideal for beautifying. The Locks are 100 years old this year, so what a gift to acknowledge that with a more intentional roadway design as visitors (on foot, bike, car or bus) approach.","idea":"(1) Repainting the crosswalks, (2) adding pedestrian-activated blinking lights for safety, and (3) planting the triangular dead space where the Y in the road is (maybe even adding a welcome sign or sculptural piece or signature tree?). Welcome visitors traveling west from central Ballard to the Locks \/ Golden Gardens area (plantings can be inspired by the botanical garden at the Locks and the lovely planted median that runs along the Burke-Gilman Trail west of here -- from the Salmon Bay Natural Area to Golden Gardens). This intersection is also where a deadly car accident happened at the Taco Time signpost, so planting that area would be of benefit to traffic safety, helping drivers better see that important bend in the road.","latitude":47.66859,"longitude":-122.39478,"location":"NW Market St and NW 54th St, between 28th Ave NW and 30th Ave NW (two crosswalks at \"Y\" in road)","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians, cars, buses. Visitors to Locks, Shilshole Marina area, and Golden Gardens.","dist":6,"neigh":"Ballard"},{"status":"Advance to Further Review","review1":16,"review2":10.0,"avg":13.0,"initial":null,"no":"17-644","combined":null,"title":"Crossing improvement in Tangletown neighborhood","need":"Cars speed through the small business district in Tangletown and it is very dangerous for pedestrians to cross the street.  This is a high pedestrian traffic business district and it needs a safe cross walk.  ","idea":"I recommend a flashing beacon and painted crosswalk or a large traffic circle or all of the above at the intersection where N 55th N 56th and Keystone Pl N all meet.  This is in the center of the business district and would provide a safe & centrally located cross walk.  ","latitude":47.66867,"longitude":-122.33299,"location":"N 55th N 56th and Keystone Pl N-Tangletown Neighborhood Between Meridian Ave N and Kirkwood","type":"Crossing Improvements","dept":"SDOT","benefits":"The pedestrians, visitors to Greenlake, home owners, business owners, all who pass through this area.  ","dist":6,"neigh":"Wallingford "},{"status":"Advance to Further Review","review1":16,"review2":14.0,"avg":15.0,"initial":null,"no":"17-661","combined":"With 17-662","title":"ADA improvements on NW 70th St @ 24th & 32nd Ave","need":"I don't have a car & do my errands via bus & walking. I use a rolling carrier to transport heavy loads. It would be helpful to have curb cuts on the sidewalks so it's easier to roll heavy loads (and so bottles don't get broken in my carrier because of the impact of going up & down curbs). ","idea":"Install curb cuts along 32nd Ave NW & NW 70th St & other streets that are major walking routes that connect to crossing lights. ","latitude":47.67951,"longitude":-122.38755,"location":"Along 32nd Ave NW. Also along NW 70th St between 24th Ave NW & 32nd Ave NW","type":"Accessibility Improvements","dept":"SDOT","benefits":"People using wheelchairs, strollers, rolling shopping carts, handtrucks, etc. Also people who have mobility impairments for whom steps are a challenge","dist":6,"neigh":"Sunset Hill"},{"status":"Advance to Further Review","review1":16,"review2":14.0,"avg":15.0,"initial":null,"no":"17-662","combined":null,"title":"Install audible crossing infrastructure at intersection of  24th Ave NW & NW 70th St","need":"Pedestrian crossing light on 24th Ave NW & NW 70th St needs an audible signal added to the crossing light","idea":"24th Ave NW is a very busy street. The crossing signal at 24th & 70th is of short duration, and pedestrians wait for several minutes before they get the walk sign. Often I miss the walk sign because I've looked away from the signal for a few moments. If you installed an audible signal to let people know the walk sign is on (like the signals in on Fremont Ave N & N 34th St), the crosswalk would be more accessible & safer ","latitude":47.679516,"longitude":-122.387591,"location":"Existing crosswalk at 24th Ave NW & NW 70th St","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians & cyclists. People with visual impairments. ","dist":6,"neigh":"Sunset Hill"},{"status":"Advance to Further Review","review1":16,"review2":16.0,"avg":16.0,"initial":null,"no":"17-676 ","combined":"With 17-679","title":"Improve crossing @ Corliss & 80th, near Greenlake","need":"Cars speed down 80th making it difficult and dangerous to utilize poorly marked (but nonetheless maked) cross walks, not to mention cross 80th anywhere. Cuts off neighborhood access to Green Lake. ","idea":"Flashing crosswalk at 80th with a traffic calming device and well marked and painted (green?) cross walk. ","latitude":47.68687,"longitude":-122.33046,"location":"80th and Corliss","type":"Crossing Improvements","dept":"SDOT","benefits":"Kids and walkers trying to get to and from Green Lake, shops along Green Lake, school (Bagley).  ","dist":6,"neigh":"Green Lake"},{"status":"Advance to Further Review","review1":16,"review2":16.0,"avg":16.0,"initial":null,"no":"17-677","combined":"With 17-679","title":"Improve crossing @ Corliss & 80th, near Greenlake","need":"Crossing 80th at Corliss is dangerous--cars are barreling to and from the freeway, and don't see--or don't care--about pedestrians, even with crossing flags. ","idea":"Flashing lights when someone is walking across the intersection.","latitude":47.68687,"longitude":-122.33046,"location":"80th and Corliss","type":"Crossing Improvements","dept":"SDOT","benefits":"Everyone who wants to catch the 316 bus, go to Green Lake, shop at the stores. If you want to reduce car usage, please make it safe for pedestrians. ","dist":6,"neigh":"Green Lake"},{"status":"Advance to Further Review","review1":16,"review2":16.0,"avg":16.0,"initial":null,"no":"17-678","combined":"With 17-679","title":"Improve crossing @ Corliss & 80th, near Greenlake","need":"80th and Corliss crosswalk is dangerous to cross with just flags. Cars are going fast and are not looking it needs to be more visble!","idea":"Needs flashing lights and beacons","latitude":47.68687,"longitude":-122.33046,"location":"80th and Corliss crosswalk","type":"Crossing Improvements","dept":"SDOT","benefits":"Kids, walkers, bus riders, pedestrians,school childeren","dist":6,"neigh":"Green Lake"},{"status":"Advance to Further Review","review1":16,"review2":16.0,"avg":16.0,"initial":null,"no":"17-679","combined":null,"title":"Improve crossing @ Corliss & 80th, near Greenlake","need":"Crossing 80th St. at Corliss Ave. in the Greenlake neighborhood is extremely unsafe.  Many people use the crosswalk to reach the bus stop, Greenlake, and various schools in the area.  Cars speeding east and west on 8th do not stop, despite the crosswalk and crossing flags. Frequently, if a car stops, the car behind it does not.  We have recently had two \"2nd in line\" cars drive up onto the grass and into the bus stop where people stand in order to avoid rear ending the car that stopped to let a pedestrian cross.  If a car heading west on 80th stops, the car behind it often thinks it is turning left onto Corliss and will rush around it instead of yielding to pedestrians.     ","idea":"Raised crosswalk and flashing beacon.  (Traffic light would be ideal, but that probably exceeds $90,000).  ","latitude":47.68687,"longitude":-122.33046,"location":"80th St. at Corliss Ave. in Greenlake. ","type":"Crossing Improvements","dept":"SDOT","benefits":"All of the pedestrians that use the existing, poorly marked crosswalk to reach the bus stops, Greenlake, neighborhood stores, and schools. Also, the cars that do stop for pedestrians would have less of a chance of being rear ended.  ","dist":6,"neigh":"Green Lake"},{"status":"Advance to Further Review","review1":16,"review2":16.0,"avg":16.0,"initial":null,"no":"17-680 ","combined":"With 17-679","title":"Improve crossing @ Corliss & 80th, near Greenlake","need":"The crosswalk at 80th and N. Corliss is extremely dangerous.  Cars do not stop. What's worse, when a westbound car does stop, oftentimes cars behind will pass around the stopped car assuming it is turning left, speeding right into an intersection with a pedestrian in it.  I have experimented with carrying a flashing light and have found that cars stop almost always.  This is a crosswalk with a lot of pedestrian traffic; my family and I have almost been hit several times and I believe it is only a matter of time until someone is hit. ","idea":"Flashing lights at the crosswalk.  I have observed other crosswalks with flashing lights; cars stop there.  I have experimented with carrying a flashing light; cars stop for me when I do.  Kirkland installed flashing beacons in crosswalks and has had no accidents in those intersections since they were installed.  Flashing lights would make the intersection more visible, but would also tap into the reflex that drivers have to pay attention and stop when they see a flashing light.  Flashing lights on the sign notifying westbound drivers may also prevent the problem of cars passing cars that are stopped (assuming they are turning left).  ","latitude":47.68687,"longitude":-122.33046,"location":"Intersection of Corliss Ave N. and 80th street in Greenlake area","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians traveling two and from Greenlake.  Also, there are two bus stops at this intersection, so bus riders would also benefit","dist":6,"neigh":"Green Lake"},{"status":"Advance to Further Review","review1":11,"review2":10.0,"avg":10.5,"initial":null,"no":"17-691","combined":null,"title":"Traffic-calming on 14th Ave NW, near Holman","need":"Cars coming off Holman Road NW speeding onto 14th Ave NW near Crown Hill Park, new Greenway going in at 92nd coming out of park there.","idea":"Put a speed hump in between Holman Rd NW and NW 92nd St. to slow people down before they encounter the new Greenway coming out of Crown Hill Park.","latitude":47.695946,"longitude":-122.374075,"location":"Between Holman Rd. NW and NW 92nd St.","type":"Traffic-Calming","dept":"SDOT","benefits":"Users of the Greenway: pedestrians, cyclists, etc. Users of the park: families, children, dog walkers. Neighbors living in the adjacent houses.","dist":6,"neigh":"Crown Hill"},{"status":"Advance to Further Review","review1":11,"review2":10.0,"avg":10.5,"initial":null,"no":"17-693","combined":"With 17-691","title":"Crossing improvement near Crown Hill Park","need":"a three-way intersection in my neighborhood is badly designed and makes crossing difficult for pedestrians  ","idea":"crosswalk beacons, higher frequency stoplight changes","latitude":47.69637,"longitude":-122.37263,"location":"Holman Rd NW, 13th Ave NW, NW 92nd St (intersection at Crown Hill Park) ","type":"Crossing Improvements","dept":"SDOT","benefits":"pedestrians \/ motorists","dist":6,"neigh":"Crown Hill"},{"status":"Advance to Further Review","review1":11,"review2":13.0,"avg":12.0,"initial":null,"no":"17-696","combined":null,"title":"ADA improvements near 97th & 8th Ave NW","need":"The location is 97th & 8th Ave NW, Ballard Rehabilitation is about a 1\/2 block away from this intersection. People come down from the Rehab Center in manual & electric wheelchairs, walkers, canes, and try to cross. No painted lines. No flashing light. Electric lines are right above and can be used to install a light very easily. People have tipped over wheelchairs trying to cross due to uneven pavement, and sometimes washed down gravel. Thank you for reading my request to repair this intersection for the disabled and elderly people. ","idea":" same as above","latitude":47.700124,"longitude":-122.366064,"location":"97 st &8th ave nw    98117","type":"Accessibility Improvements","dept":"SDOT","benefits":"The people in the neighborhood and most of all the people recovering at Ballard Rehabilitation Center, and senior and disabled low income housing residents. ","dist":6,"neigh":"Crown hill"},{"status":"Advance to Further Review","review1":18,"review2":15.0,"avg":16.5,"initial":null,"no":"17-715","combined":null,"title":"Crosswalk improvement at Denny Way and 5th Ave intersection","need":"Pedestrians on heavily trafficked Denny Way have a hard time crossing 5th Avenue as cars speed up as they make the turn from either Denny Way or 5th Ave N. The crosswalk is placed at an angle behind Monorail tracks that makes it easy for vehicles to speed by.","idea":"The crossing of 5th Avenue at Denny Way could be improved by adding a pedestrian refuge island as well as curb extensions from both sides of the crosswalk. Narrowing the roadway lanes would ensure that cars do not speed up as they head south on 5th Ave.","latitude":47.618565,"longitude":-122.347457,"location":"Denny Way and 5th Avenue, south side of Denny Way east of Tillicum Place park.","type":"Crossing Improvements","dept":"SDOT","benefits":"People walking between the heavily pedestrian oriented areas of Belltown, Seattle Center, and South Lake Union.","dist":7,"neigh":"Belltown"},{"status":"Advance to Further Review","review1":15,"review2":17.0,"avg":16.0,"initial":null,"no":"17-717","combined":null,"title":"Crossing improvement at intersection of 1st Ave N and Thomas St","need":"The intersection of 1st Ave N and Thomas St experiences extremely high pedestrian and vehicle traffic due to its location a block from both Key Arena and Seattle Center. It's the main intersection for people parking in the neighborhood to cross to these locations, particularly Seattle Center across 1st Ave N. Despite this, the intersection has no traffic signal and not even marked crosswalks to assist people crossing 2-3 lanes of busy, often non-local traffic. After living on this corner for four years, I've witnessed multiple vehicle accidents due to the poor markings of this intersection, as well as several near-accidents involving pedestrians attempting to cross. Despite having no crosswalk or stop signs, vehicles frequently stop their lane of traffic to allow pedestrians to cross, creating a high potential for accidents for both vehicles behind them due to the unexpected stoppage, and for pedestrians who may not realize that the other lanes have not stopped to allow them to cross safely.","idea":"Marked crosswalks across 1st Ave N at Thomas St, potentially with flashing beacons to increase visibility particularly at night, would indicate to vehicles that they should be on the lookout for pedestrians crossing at this busy intersection. This would increase traffic safety both for vehicles and for pedestrians.","latitude":47.620934,"longitude":-122.355441,"location":"1st Ave N and Thomas St intersection","type":"Crossing Improvements","dept":"SDOT","benefits":"This project would benefit both locals--the residential density of the Uptown\/Lower Queen Anne area is rapidly increasing--and the huge influx of non-residents due to tourist and event destinations in the neighborhood, such as Seattle Center and Key Arena.","dist":7,"neigh":"Uptown"},{"status":"Advance to Further Review","review1":12,"review2":20.0,"avg":16.0,"initial":null,"no":"17-728","combined":null,"title":"Trail Construction in Lower Kinnear Park","need":"There is no permanent walking path between the southwest corner of Lower Kinnear Park to the sidewalk on Elliot Ave. West.  Lower Kinnear Park has a set of stairs that brings pedestrians from the park to West Mercer Place, but there is no permanent path that connects those stairs to the sidewalk on Elliot Ave. West.","idea":"Build a permanent path that connects the stairs to the sidewalk on West Mercer Place.  This could be done by extending the sidewalk to the stairs, or covering a path with gravel.  Also, it would be nice to remove the weeds and other growth along the path.","latitude":47.627705,"longitude":-122.365128,"location":"In Lower Kinnear Park near the intersection of West Mercer Place and Elliot Ave. West.","type":"Walkways","dept":"SDOT","benefits":"People that walk from Uptown to Elliot Ave. West.  In the future Expedia will be located in that area and a better path will allow for easier walking for the new Expedia employees.","dist":7,"neigh":"Uptown"},{"status":"Advance to Further Review","review1":12,"review2":20.0,"avg":16.0,"initial":null,"no":"17-730","combined":null,"title":"Accessibility improvements to entrance of Kinnear Park","need":"We need our parks to be accessible by people who are mobility impaired and\/or confined to a wheelchair.","idea":"Modify the north entrance to Upper Kinnear Park to comply with ADA requirements.","latitude":47.628681,"longitude":-122.360077,"location":"Kinnear Park entrance near the intersection of Olympic Way West, West Olympic Place, and 8th Avenue West","type":"Park Equipment","dept":"Parks","benefits":"Anyone who is mobility impaired will now have equal access to the park with those who are able-bodied.  Due to a lack of sidewalks on one side of Olympic Place and stairs on the other side, this entrance would provide the only wheelchair accessible route up and down the hill.","dist":7,"neigh":"Queen Anne "},{"status":"Advance to Further Review","review1":9,"review2":18.0,"avg":13.5,"initial":null,"no":"17-737","combined":null,"title":"Crossing improvements on Dexter Ave N @ Galer and Comstock Sts","need":"Arterial street with vertical curves, heavy vehicular and bicycle traffic in an increasingly densely populated neighborhood.   ","idea":"Per the SDOT NSF Report 2016-015, install RRFB systems at these two crossing locations.  According to the menu of costs provided for different improvements the installation of RRFB's at these two intersections could be accomplished within the $90k budget.  The curb bulb recommendations and repainting of the crosswalks could be completed as a future upgrade.   ","latitude":47.6323,"longitude":-122.3423,"location":"Dexter Ave N @ 1) Galer St and 2) Comstock St","type":"Crossing Improvements","dept":"SDOT","benefits":"Residents, commuters, drivers, and cyclists would benefit from the increased visibility of pedestrians attempting to cross Dexter.  This roadway can be quite busy for drivers and indicators like RRFBs can help notify drivers of the presence of pedestrians in these crosswalks.  With the increased density in housing along Dexter, providing safe connections down to Westlake and up to the top of Queen Anne will help improve livability.  ","dist":7,"neigh":"Queen Anne"},{"status":"Advance to Further Review","review1":17,"review2":15.0,"avg":16.0,"initial":null,"no":"17-742","combined":null,"title":"Improved crossing in several Queen Anne locations","need":"Improving pedestrian safety across arterials in Queen Anne by painting crosswalks at three key locations corresponding with commercial\/retail.  These 3 locations were previously studied by SDOT with the recommendation for adding painting crosswalks. ","idea":"Painting standard zebra crosswalks at these locations.  Please refer to the SDOT Reports 2016-117 and 2016-79 for the recommendations of improvements and basis for the recommendation to add crosswalks to these locations (http:\/\/www.seattle.gov\/transportation\/nsf_projects.htm).","latitude":47.63596,"longitude":-122.35696,"location":"Here are the three locations: 1) Queen Anne Ave N @ Howe Street along north side of intersection; 2) 6th Ave W @ Crockett St along north side of intersection; 3) W Galer Street @ 3rd Ave W ","type":"Crossing Improvements","dept":"SDOT","benefits":"All of the folks of all ages living, visiting, or shopping on Queen Anne.      For Location 1) There are a tremendous number of people who shop at Trader Joe's and the surrounding stores. This also connects QA Community Center, QA Pool, Big Howe Park, Little Howe Park, and more.  Shoppers along with children from surrounding daycares, McClure, and families visiting the QA Farmers Market would benefit greatly from this marked crossing, as it would be a visual cue to drivers of the presence and prioritization of pedestrians.  Many families with strollers or young kids cross here.    2)  This is a naturally level East-West walking route between the west side of the hill and east side, with a direct connection to McClure Middle School.  The key is that this route along Crockett St is very flat compared to other east-west streets and has a direct intersection with the businesses centered on 6th Ave W & Crockett.     3) As the SDOT Report 2016-79 refers to it: This crossing would link the north and south side of this stretch of Galer known as the Sweet Street. All of the businesses here support the idea of a painted crossing, including Molly Moons, Top Pot, and Caffe Fiori.  It also connects directly with Kerry Park, Big Howe and the QA Library. Seniors, commuter, school children all cross Galer and this will provide a safe route at the low point in the topography.  ","dist":7,"neigh":"Queen Anne"},{"status":"Advance to Further Review","review1":17,"review2":15.0,"avg":16.0,"initial":null,"no":"17-743","combined":"With 17-742","title":"Crossing Improvements at QA Ave N and Howe","need":"Improve safe pedestrian crossing of an arterial in the commercial block with heavy pedestrian traffic.","idea":"Add a crosswalk and, ideally a curb bulb.","latitude":47.63596,"longitude":-122.35696,"location":"The east\/west crossing at QA Ave N and Howe - explored in SDOT 16-117 (2-B) Report December 2016","type":"Crossing Improvements","dept":"SDOT","benefits":"Children + adults who use this crossing to access the QA Community Center, QA Pool, and business in this block.","dist":7,"neigh":"Queen Anne"},{"status":"Advance to Further Review","review1":18,"review2":14.0,"avg":16.0,"initial":null,"no":"17-752","combined":null,"title":"Sidewalk & improved bus stop on Thorndyke Ave W.","need":"On Thorndyke Ave. W., not only do cars speed, but there is one particular bus stop location that is dangerous due to lack of facilities for those waiting for the bus. Currently, people waiting for the bus at this location must either stand in mud and blackberry brambles, or in the middle of the bike lane. As this area is growing (more condos being built in recent years), there are more people riding the bus (which is great!); but if there are more than 2 or 3 people waiting for the bus at this location, it becomes dangerous because the bus riders are pushed further out into the roadway with nowhere else to wait.","idea":"There is no sidewalk at this particular location and wild blackberries and other vegetation is encroaching the area. At the very least, a small concrete (or other material? something pervious?) pad for bus riders to gather while waiting for the bus. I really don't know who owns the very overgrown land where the bus stop is, but it needs to be cleared back to allow space for people waiting for the bus that is OFF the roadway. Ideally, this short span of roadway should have a sidewalk; currently, pedestrians must walk in the bike lane to travel this section of the road.    The bus stop across the street could also use a concrete (or other material) waiting pad - but the west side of the street is a higher priority due to danger!","latitude":47.64064,"longitude":-122.38635,"location":"Thorndyke Ave. W. at about 23rd Ave. W.; west-side of the street. The address of the apartment building located at the bus stop is 2451 Thorndyke Ave. W.","type":"Walkways","dept":"SDOT","benefits":"Neighbors who catch the bus here (which has definitely been increasing in recent years, especially during morning rush hours); neighbors who take walks along Thorndyke (it can feel even more dangerous if you have a dog or a child with you in this spot!). As it currently is, people with strollers or in wheelchairs are in even more danger. It is definitely not pedestrian-friendly here.","dist":7,"neigh":"Magnolia"},{"status":"Advance to Further Review","review1":20,"review2":20.0,"avg":20.0,"initial":null,"no":"17-759","combined":null,"title":"Crossing improvements at upper N. Raye St and 4th Ave N.","need":"On the north end of Queen Anne, a large, confusing 7-way intersection presents a difficult situation for both vehicle drivers and for pedestrians making their way to or under the SR99 Aurora Bridge. Very large pavement areas combined with a lack of crosswalks and ADA ramps makes this especially dangerous for pedestrians.","idea":"Given that upper Raye Street has been made one-way away from the intersection, we propose to create a curb bulb to narrow that roadway, and to add crosswalks and ADA ramps to create a clear and visible path from the various points of the intersection to the sidewalk leading to the Aurora Bridge. This has been studied by QA Greenways and in the SDOT report 16-025, from December 2016.","latitude":47.643,"longitude":-122.34955,"location":"upper North Raye Street and 4th Avenue North","type":"Crossing Improvements","dept":"SDOT","benefits":"Both the many vehicle drivers who have to navigate the large, undifferentiated pavement, and the pedestrians who currently cannot safely cross it would benefit from these simple changes.","dist":7,"neigh":"Queen Anne"},{"status":"Advance to Further Review","review1":15,"review2":20.0,"avg":17.5,"initial":null,"no":"17-761","combined":null,"title":"Install flashing beacon at 3rd Ave W, near Fulton St. ","need":"Install flashing beacons at existing crosswalk located in the 2800 block between W Fulton Street and W Armour Street on 3rd Ave W.  Crosswalk is used by sports field users from the Parks parking lot to the QA Bowl field & by people accessing the  bus stops next to the crosswalk","idea":"Install flashing beacons","latitude":47.64578,"longitude":-122.3609,"location":"2800 block of 3rd Ave W between W Fulton Street & W Armour Street","type":"Crossing Improvements","dept":"SDOT","benefits":"Parks users, transit users, & pedestrians ","dist":7,"neigh":"Queen Anne"}]